{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "APT-C-36",
    "1": "APT1",
    "2": "APT12",
    "3": "APT17",
    "4": "APT18",
    "5": "APT19",
    "6": "APT28",
    "7": "APT29",
    "8": "APT3",
    "9": "APT30",
    "10": "APT32",
    "11": "APT33",
    "12": "APT37",
    "13": "APT38",
    "14": "APT39",
    "15": "APT41",
    "16": "APT42",
    "17": "APT5",
    "18": "Agrius",
    "19": "Ajax Security Team",
    "20": "Akira",
    "21": "Andariel",
    "22": "Aoqin Dragon",
    "23": "Aquatic Panda",
    "24": "Axiom",
    "25": "BITTER",
    "26": "BRONZE BUTLER",
    "27": "BackdoorDiplomacy",
    "28": "BlackByte",
    "29": "BlackOasis",
    "30": "BlackTech",
    "31": "Blue Mockingbird",
    "32": "CURIUM",
    "33": "Carbanak",
    "34": "Chimera",
    "35": "Cinnamon Tempest",
    "36": "Cleaver",
    "37": "Cobalt Group",
    "38": "Confucius",
    "39": "CopyKittens",
    "40": "Daggerfly",
    "41": "Dark Caracal",
    "42": "DarkHydrus",
    "43": "DarkVishnya",
    "44": "Darkhotel",
    "45": "Deep Panda",
    "46": "Dragonfly",
    "47": "EXOTIC LILY",
    "48": "Earth Lusca",
    "49": "Elderwood",
    "50": "Ember Bear",
    "51": "Equation",
    "52": "Evilnum",
    "53": "FIN10",
    "54": "FIN13",
    "55": "FIN4",
    "56": "FIN5",
    "57": "FIN6",
    "58": "FIN7",
    "59": "FIN8",
    "60": "Ferocious Kitten",
    "61": "Fox Kitten",
    "62": "GALLIUM",
    "63": "GCMAN",
    "64": "GOLD SOUTHFIELD",
    "65": "Gallmaker",
    "66": "Gamaredon Group",
    "67": "Gorgon Group",
    "68": "Group5",
    "69": "HAFNIUM",
    "70": "HEXANE",
    "71": "Higaisa",
    "72": "INC Ransom",
    "73": "Inception",
    "74": "IndigoZebra",
    "75": "Indrik Spider",
    "76": "Ke3chang",
    "77": "Kimsuky",
    "78": "LAPSUS$",
    "79": "Lazarus Group",
    "80": "LazyScripter",
    "81": "Leafminer",
    "82": "Leviathan",
    "83": "Lotus Blossom",
    "84": "LuminousMoth",
    "85": "Machete",
    "86": "Magic Hound",
    "87": "Malteiro",
    "88": "Metador",
    "89": "Moafee",
    "90": "Mofang",
    "91": "Molerats",
    "92": "Moonstone Sleet",
    "93": "Moses Staff",
    "94": "MoustachedBouncer",
    "95": "MuddyWater",
    "96": "Mustang Panda",
    "97": "Mustard Tempest",
    "98": "Naikon",
    "99": "Nomadic Octopus",
    "100": "OilRig",
    "101": "Orangeworm",
    "102": "PLATINUM",
    "103": "POLONIUM",
    "104": "PROMETHIUM",
    "105": "Patchwork",
    "106": "PittyTiger",
    "107": "Play",
    "108": "Poseidon Group",
    "109": "Putter Panda",
    "110": "RTM",
    "111": "Rancor",
    "112": "RedCurl",
    "113": "RedEcho",
    "114": "Rocke",
    "115": "Saint Bear",
    "116": "Salt Typhoon",
    "117": "Sandworm Team",
    "118": "Scarlet Mimic",
    "119": "Scattered Spider",
    "120": "Sea Turtle",
    "121": "SideCopy",
    "122": "Sidewinder",
    "123": "Silence",
    "124": "Silent Librarian",
    "125": "SilverTerrier",
    "126": "Sowbug",
    "127": "Star Blizzard",
    "128": "Stealth Falcon",
    "129": "Storm-1811",
    "130": "Strider",
    "131": "Suckfly",
    "132": "TA2541",
    "133": "TA459",
    "134": "TA505",
    "135": "TA551",
    "136": "TA577",
    "137": "TA578",
    "138": "TeamTNT",
    "139": "The White Company",
    "140": "Threat Group-1314",
    "141": "Threat Group-3390",
    "142": "Thrip",
    "143": "ToddyCat",
    "144": "Tonto Team",
    "145": "Transparent Tribe",
    "146": "Tropic Trooper",
    "147": "Turla",
    "148": "Velvet Ant",
    "149": "Volatile Cedar",
    "150": "Volt Typhoon",
    "151": "WIRTE",
    "152": "Whitefly",
    "153": "Windigo",
    "154": "Windshift",
    "155": "Winnti Group",
    "156": "Winter Vivern",
    "157": "Wizard Spider",
    "158": "ZIRCONIUM",
    "159": "admin@338",
    "160": "menuPass"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "APT-C-36": 0,
    "APT1": 1,
    "APT12": 2,
    "APT17": 3,
    "APT18": 4,
    "APT19": 5,
    "APT28": 6,
    "APT29": 7,
    "APT3": 8,
    "APT30": 9,
    "APT32": 10,
    "APT33": 11,
    "APT37": 12,
    "APT38": 13,
    "APT39": 14,
    "APT41": 15,
    "APT42": 16,
    "APT5": 17,
    "Agrius": 18,
    "Ajax Security Team": 19,
    "Akira": 20,
    "Andariel": 21,
    "Aoqin Dragon": 22,
    "Aquatic Panda": 23,
    "Axiom": 24,
    "BITTER": 25,
    "BRONZE BUTLER": 26,
    "BackdoorDiplomacy": 27,
    "BlackByte": 28,
    "BlackOasis": 29,
    "BlackTech": 30,
    "Blue Mockingbird": 31,
    "CURIUM": 32,
    "Carbanak": 33,
    "Chimera": 34,
    "Cinnamon Tempest": 35,
    "Cleaver": 36,
    "Cobalt Group": 37,
    "Confucius": 38,
    "CopyKittens": 39,
    "Daggerfly": 40,
    "Dark Caracal": 41,
    "DarkHydrus": 42,
    "DarkVishnya": 43,
    "Darkhotel": 44,
    "Deep Panda": 45,
    "Dragonfly": 46,
    "EXOTIC LILY": 47,
    "Earth Lusca": 48,
    "Elderwood": 49,
    "Ember Bear": 50,
    "Equation": 51,
    "Evilnum": 52,
    "FIN10": 53,
    "FIN13": 54,
    "FIN4": 55,
    "FIN5": 56,
    "FIN6": 57,
    "FIN7": 58,
    "FIN8": 59,
    "Ferocious Kitten": 60,
    "Fox Kitten": 61,
    "GALLIUM": 62,
    "GCMAN": 63,
    "GOLD SOUTHFIELD": 64,
    "Gallmaker": 65,
    "Gamaredon Group": 66,
    "Gorgon Group": 67,
    "Group5": 68,
    "HAFNIUM": 69,
    "HEXANE": 70,
    "Higaisa": 71,
    "INC Ransom": 72,
    "Inception": 73,
    "IndigoZebra": 74,
    "Indrik Spider": 75,
    "Ke3chang": 76,
    "Kimsuky": 77,
    "LAPSUS$": 78,
    "Lazarus Group": 79,
    "LazyScripter": 80,
    "Leafminer": 81,
    "Leviathan": 82,
    "Lotus Blossom": 83,
    "LuminousMoth": 84,
    "Machete": 85,
    "Magic Hound": 86,
    "Malteiro": 87,
    "Metador": 88,
    "Moafee": 89,
    "Mofang": 90,
    "Molerats": 91,
    "Moonstone Sleet": 92,
    "Moses Staff": 93,
    "MoustachedBouncer": 94,
    "MuddyWater": 95,
    "Mustang Panda": 96,
    "Mustard Tempest": 97,
    "Naikon": 98,
    "Nomadic Octopus": 99,
    "OilRig": 100,
    "Orangeworm": 101,
    "PLATINUM": 102,
    "POLONIUM": 103,
    "PROMETHIUM": 104,
    "Patchwork": 105,
    "PittyTiger": 106,
    "Play": 107,
    "Poseidon Group": 108,
    "Putter Panda": 109,
    "RTM": 110,
    "Rancor": 111,
    "RedCurl": 112,
    "RedEcho": 113,
    "Rocke": 114,
    "Saint Bear": 115,
    "Salt Typhoon": 116,
    "Sandworm Team": 117,
    "Scarlet Mimic": 118,
    "Scattered Spider": 119,
    "Sea Turtle": 120,
    "SideCopy": 121,
    "Sidewinder": 122,
    "Silence": 123,
    "Silent Librarian": 124,
    "SilverTerrier": 125,
    "Sowbug": 126,
    "Star Blizzard": 127,
    "Stealth Falcon": 128,
    "Storm-1811": 129,
    "Strider": 130,
    "Suckfly": 131,
    "TA2541": 132,
    "TA459": 133,
    "TA505": 134,
    "TA551": 135,
    "TA577": 136,
    "TA578": 137,
    "TeamTNT": 138,
    "The White Company": 139,
    "Threat Group-1314": 140,
    "Threat Group-3390": 141,
    "Thrip": 142,
    "ToddyCat": 143,
    "Tonto Team": 144,
    "Transparent Tribe": 145,
    "Tropic Trooper": 146,
    "Turla": 147,
    "Velvet Ant": 148,
    "Volatile Cedar": 149,
    "Volt Typhoon": 150,
    "WIRTE": 151,
    "Whitefly": 152,
    "Windigo": 153,
    "Windshift": 154,
    "Winnti Group": 155,
    "Winter Vivern": 156,
    "Wizard Spider": 157,
    "ZIRCONIUM": 158,
    "admin@338": 159,
    "menuPass": 160
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "transformers_version": "4.57.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
